// Nudi keyboard mapping rules & reverse lookup table
const NUDI_MAP = {
    'a': 'ಅ', 'A': 'ಆ', 'i': 'ಇ', 'I': 'ಈ', 'u': 'ಉ', 'U': 'ಊ',
    'R': 'ಋ', 'e': 'ಎ', 'E': 'ಏ', 'Y': 'ಐ', 'o': 'ಒ', 'O': 'ಓ', 'V': 'ಔ',
    'M': 'ಂ', 'H': 'ಃ', 'f': '್',
    'k': 'ಕ್', 'K': 'ಖ್', 'g': 'ಗ್', 'G': 'ಘ್',
    't': 'ಟ್', 'T': 'ಠ್', 'd': 'ಡ್', 'D': 'ಢ್', 'N': 'ಣ್',
    'p': 'ಪ್', 'P': 'ಫ್', 'b': 'ಬ್', 'B': 'ಭ್', 'm': 'ಮ್',
    'y': 'ಯ್', 'r': 'ರ್', 'l': 'ಲ್', 'v': 'ವ್', 's': 'ಸ್', 'x': 'ಷ್', 'S': 'ಶ್', 'h': 'ಹ್'
};

window.nudiReverseMap = {
    'ಅ': 'a',
    'ಆ': 'A',
    'ಇ': 'i',
    'ಈ': 'I',
    'ಉ': 'u',
    'ಊ': 'U',
    'ಋ': 'R',
    'ಎ': 'e',
    'ಏ': 'E',
    'ಐ': 'Y',
    'ಒ': 'o',
    'ಓ': 'O',
    'ಔ': 'V',
    'ಅಂ': 'aM',
    'ಅಃ': 'aH',
    'ಂ': 'M',
    'ಃ': 'H',
    '್': 'f',
    'ಕ': 'k', 'ಖ': 'K', 'ಗ': 'g', 'ಘ': 'G', 'ಙ': 'W',
    'ಚ': 'c', 'ಛ': 'C', 'ಜ': 'j', 'ಝ': 'J', 'ಞ': 'z',
    'ಟ': 'q', 'ಠ': 'Q', 'ಡ': 'w', 'ಢ': 'W', 'ಣ': 'N',
    'ತ': 't', 'ಥ': 'T', 'ದ': 'd', 'ಧ': 'D', 'ನ': 'n',
    'ಪ': 'p', 'ಫ': 'P', 'ಬ': 'b', 'ಭ': 'B', 'ಮ': 'm',
    'ಯ': 'y', 'ರ': 'r', 'ಲ': 'l', 'ವ': 'v', 'ಶ': 'S',
    'ಷ': 'x', 'ಸ': 's', 'ಹ': 'h', 'ಳ': 'L'
};